# Assignment No 7 (Task 1 and Task 2)

# Task 1

Read the following data set:
https://archive.ics.uci.edu/ml/machine-learning-databases/adult/
    
Rename the columns as per the description from this file:
https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.names

In [23]:
# Question No 1
# Create a sql db from adult dataset and name it sqladb
# 1. Select 10 records from the adult sqladb

In [24]:
import pandas as pd
dataSet = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data",header=None)
type(dataSet)

pandas.core.frame.DataFrame

In [25]:
dataSet.columns = ['age', 'workclass','fnlwgt','education','education_num','marital_status','occupation','relationship'
              ,'race','sex','capital_gain','capital_loss','hours_per_week','native_country','salary']
dataSet.head()
dataSet['sex'] = dataSet['sex'].str.lstrip() # sremoveing extra spaces from left side 
dataSet['workclass'] = dataSet['workclass'].str.lstrip()

In [26]:
import sqlite3
connection = sqlite3.connect('sqladb') # Created Database as per guidlines
cursor = connection.cursor() # Cursor to perform task over database

In [27]:
dataSet.to_sql('adultData',connection)

In [28]:
q = """SELECT * FROM adultData LIMIT 10;"""
pd.read_sql(q, connection) # Fetching First Ten Records

,index,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,salary
0,0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
5,5,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
6,6,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0,0,16,Jamaica,<=50K
7,7,52,Self-emp-not-inc,209642,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,>50K
8,8,31,Private,45781,Masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K
9,9,42,Private,159449,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178,0,40,United-States,>50K

In [ ]:
# Question No 2
# 2. Show me the average hours per week of all men who are working in private sector

In [29]:
q = """SELECT avg(hours_per_week) Average FROM adultData where sex='Male' and workclass='Private'"""
pd.read_sql(q, connection) # Avergae working hours of Private Sector Men

     Average
0  42.221226

In [ ]:
# Question No 3
# 3. Show me the frequency table for education, occupation and relationship, separately

In [ ]:
q = """
        create table frequency(
        education varchar(50), 
        occupation varchar(50),
        relationship varchar(50)
        );
    """
pd.read_sql(q, connection)
# Created Seprtate table

In [35]:
q="""select * from frequency"""
data= pd.read_sql(q,connection)

In [36]:
q = """SELECT education, occupation, relationship FROM adultData """

data_= pd.read_sql(q,connection)
data_.head()

    education          occupation    relationship
0   Bachelors        Adm-clerical   Not-in-family
1   Bachelors     Exec-managerial         Husband
2     HS-grad   Handlers-cleaners   Not-in-family
3        11th   Handlers-cleaners         Husband
4   Bachelors      Prof-specialty            Wife

In [37]:
# Question No 4
# 4. Are there any people who are married, working in private sector and having a masters degree

In [38]:
#dataSet['marital_status'] = dataSet['marital_status'].str.lstrip()
#dataSet['education'] = dataSet['education'].str.lstrip()

In [39]:
import sqlite3
from pandas.io import sql
query=''' insert or replace into frequency (education, occupation, relationship) values (?,?,?) '''
connection.executemany(query, data_.to_records(index=False))
q_updated_r ="""select * from frequency"""
Data_update = pd.read_sql(q_updated_r,connection)
Data_update.head()

    education          occupation    relationship
0   Bachelors        Adm-clerical   Not-in-family
1   Bachelors     Exec-managerial         Husband
2     HS-grad   Handlers-cleaners   Not-in-family
3        11th   Handlers-cleaners         Husband
4   Bachelors      Prof-specialty            Wife

In [40]:
q="""
    select count(*) Result from adultData 
    where 
    (marital_status <>'Never-married' or marital_status <> 'Divorced') and workclass='Private' and education=' Masters'
    """
pd.read_sql(q, connection)

   Result
0     894

In [15]:
# Question No 5
# 5. What is the average, minimum and maximum age group for people working in different sectors

In [41]:
q="""select workclass,avg(age) Avg,min(age) Min,max(age) max from adultData group by workclass"""
#q="""select count(*) from adultData where workclass='?'"""
workclass = pd.read_sql(q, connection)
workclass.head(10)

          workclass        Avg  Min  max
0                 ?  40.960240   17   90
1       Federal-gov  42.590625   17   90
2         Local-gov  41.751075   17   90
3      Never-worked  20.571429   17   30
4           Private  36.797585   17   90
5      Self-emp-inc  46.017025   17   84
6  Self-emp-not-inc  44.969697   17   90
7         State-gov  39.436055   17   81
8       Without-pay  47.785714   19   72

In [42]:
# Question No 6
# 6. Calculate age distribution by country

In [43]:
q="""select native_country,avg(age) Avg,min(age) Min, max(age) min from adultData group by native_country"""
distribution_by_country= pd.read_sql(q, connection)
distribution_by_country.head()

  native_country        Avg  Min  min
0              ?  38.725557   17   90
1       Cambodia  37.789474   18   65
2         Canada  42.545455   17   80
3          China  42.533333   22   75
4       Columbia  39.711864   18   75

In [44]:
# Question No 7
# 7. Compute a new column as 'Net-Capital-Gain' from the two columns 'capital-gain' and 'capital-loss'

In [45]:
q="""select capital_gain,capital_loss,(capital_gain+' '+capital_loss) Net_capital_Gain from adultData"""
Net_Capital_Gain = pd.read_sql(q, connection)
Net_Capital_Gain.head()

   capital_gain  capital_loss  Net_capital_Gain
0          2174             0              2174
1             0             0                 0
2             0             0                 0
3             0             0                 0
4             0             0                 0

# Task 2


Read the following data set:
https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data

In [53]:
# Question No 1
# 1. Create an sqlalchemy engine using a sample from the data set

In [54]:
from sqlalchemy import create_engine
engine = create_engine('sqlite:///sample', echo=True)

In [55]:
conn = engine.connect()

2018-07-31 22:30:41,982 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2018-07-31 22:30:42,001 INFO sqlalchemy.engine.base.Engine ()
2018-07-31 22:30:42,008 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2018-07-31 22:30:42,017 INFO sqlalchemy.engine.base.Engine ()

In [56]:
from sqlalchemy import Table, Column, Integer, String, MetaData, ForeignKey
metadata = MetaData()
employee = Table('employee', metadata,
              Column('id', Integer, primary_key=True),
              Column('age', Integer),
              Column('workclass', String),
              Column('fnlwgt', Integer),
              Column('education', String),
              Column('education_num', Integer),
              Column('marital_status', String),
              Column('occupation', String),
              Column('relationship', String),
              Column('rasexce', String),
              Column('sex', String),
              Column('capital_gain', Integer),
              Column('capital_loss', Integer),
              Column('hours_per_week', Integer),
              Column('native_country', String),
              Column('salary', String),
)
metadata.create_all(engine)

2018-07-31 22:31:17,413 INFO sqlalchemy.engine.base.Engine PRAGMA table_info("employee")
2018-07-31 22:31:17,425 INFO sqlalchemy.engine.base.Engine ()
2018-07-31 22:31:17,441 INFO sqlalchemy.engine.base.Engine
CREATE TABLE employee (
	id INTEGER NOT NULL,
	age INTEGER,
	workclass VARCHAR,
	fnlwgt INTEGER,
	education VARCHAR,
	education_num INTEGER,
	marital_status VARCHAR,
	occupation VARCHAR,
	relationship VARCHAR,
	rasexce VARCHAR,
	sex VARCHAR,
	capital_gain INTEGER,
	capital_loss INTEGER,
	hours_per_week INTEGER,
	native_country VARCHAR,
	salary VARCHAR,
	PRIMARY KEY (id)
)


2018-07-31 22:31:17,454 INFO sqlalchemy.engine.base.Engine ()
2018-07-31 22:31:17,893 INFO sqlalchemy.engine.base.Engine COMMIT

In [57]:
ins1 = employee.insert().values(id=1, age=39,workclass='State-gov', fnlwgt=77516
                               ,education='Bachelors', education_num=13,marital_status='Never-married', occupation='Adm-clerical'
                            ,relationship='Not-in-family', rasexce='white',sex='Male', capital_gain=2174
                              ,capital_loss=0, hours_per_week=40,native_country='united-states', salary='<=50k'
                              )
ins2 = employee.insert().values(id=2, age=50,workclass='Self-emp-not-inc', fnlwgt=83311
                               ,education='Bachelors', education_num=13,marital_status='Married-civ-spouse', occupation='Exec-managerial'
                              ,relationship='Husband', rasexce='white',sex='Male', capital_gain=0
                              ,capital_loss=0, hours_per_week=13,native_country='united-states', salary='<=50k'
                              )
ins3 = employee.insert().values(id=3, age=38,workclass='Private', fnlwgt=215646
                               ,education='HS-grad', education_num=9,marital_status='Divorced', occupation='Handlers-cleaners'
                              ,relationship='Not-in-family', rasexce='white',sex='Male', capital_gain=0
                              ,capital_loss=0, hours_per_week=40,native_country='united-states', salary='<=50k'
                              )
#str(ins1)
#ins1.compile().params  # to view the data to be inserted
conn.execute(ins1)
conn.execute(ins2)
conn.execute(ins3)

2018-07-31 22:31:50,058 INFO sqlalchemy.engine.base.Engine INSERT INTO employee (id, age, workclass, fnlwgt, education, education_num, marital_status, occupation, relationship, rasexce, sex, capital_gain, capital_loss, hours_per_week, native_country, salary) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2018-07-31 22:31:50,070 INFO sqlalchemy.engine.base.Engine (1, 39, 'State-gov', 77516, 'Bachelors', 13, 'Never-married', 'Adm-clerical', 'Not-in-family', 'white', 'Male', 2174, 0, 40, 'united-states', '<=50k')
2018-07-31 22:31:50,091 INFO sqlalchemy.engine.base.Engine COMMIT
2018-07-31 22:31:50,404 INFO sqlalchemy.engine.base.Engine INSERT INTO employee (id, age, workclass, fnlwgt, education, education_num, marital_status, occupation, relationship, rasexce, sex, capital_gain, capital_loss, hours_per_week, native_country, salary) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2018-07-31 22:31:50,407 INFO sqlalchemy.engine.base.Engine (2, 50, 'Self-emp-not-inc', 83311, 'Bachelors', 13, 'Married-civ-spouse', 'Exec-managerial', 'Husband', 'white', 'Male', 0, 0, 13, 'united-states', '<=50k')
2018-07-31 22:31:50,425 INFO sqlalchemy.engine.base.Engine COMMIT
2018-07-31 22:31:50,704 INFO sqlalchemy.engine.base.Engine INSERT INTO employee (id, age, workclass, fnlwgt, education, education_num, marital_status, occupation, relationship, rasexce, sex, capital_gain, capital_loss, hours_per_week, native_country, salary) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2018-07-31 22:31:50,714 INFO sqlalchemy.engine.base.Engine (3, 38, 'Private', 215646, 'HS-grad', 9, 'Divorced', 'Handlers-cleaners', 'Not-in-family', 'white', 'Male', 0, 0, 40, 'united-states', '<=50k')
2018-07-31 22:31:50,749 INFO sqlalchemy.engine.base.Engine COMMIT

In [58]:
from sqlalchemy.sql import select
s = select([employee])
result = conn.execute(s)
row = result.fetchall()
print(row)

2018-07-31 22:32:16,346 INFO sqlalchemy.engine.base.Engine SELECT employee.id, employee.age, employee.workclass, employee.fnlwgt, employee.education, employee.education_num, employee.marital_status, employee.occupation, employee.relationship, employee.rasexce, employee.sex, employee.capital_gain, employee.capital_loss, employee.hours_per_week, employee.native_country, employee.salary
FROM employee
2018-07-31 22:32:16,352 INFO sqlalchemy.engine.base.Engine ()
[(1, 39, 'State-gov', 77516, 'Bachelors', 13, 'Never-married', 'Adm-clerical', 'Not-in-family', 'white', 'Male', 2174, 0, 40, 'united-states', '<=50k'), (2, 50, 'Self-emp-not-inc', 83311, 'Bachelors', 13, 'Married-civ-spouse', 'Exec-managerial', 'Husband', 'white', 'Male', 0, 0, 13, 'united-states', '<=50k'), (3, 38, 'Private', 215646, 'HS-grad', 9, 'Divorced', 'Handlers-cleaners', 'Not-in-family', 'white', 'Male', 0, 0, 40, 'united-states', '<=50k')]

In [59]:
# Question No 2
# 2. Write two basic update queries

In [60]:
from sqlalchemy import update

a1= update(employee).where(employee.c.id==1).values(age=49)
a2 = update(employee).where(employee.c.id==1).values(marital_status='Married')
conn.execute(a1)
conn.execute(a2)

2018-07-31 22:33:20,114 INFO sqlalchemy.engine.base.Engine UPDATE employee SET age=? WHERE employee.id = ?
2018-07-31 22:33:20,120 INFO sqlalchemy.engine.base.Engine (49, 1)
2018-07-31 22:33:20,136 INFO sqlalchemy.engine.base.Engine COMMIT
2018-07-31 22:33:20,489 INFO sqlalchemy.engine.base.Engine UPDATE employee SET marital_status=? WHERE employee.id = ?
2018-07-31 22:33:20,492 INFO sqlalchemy.engine.base.Engine ('Married', 1)
2018-07-31 22:33:20,507 INFO sqlalchemy.engine.base.Engine COMMIT

In [61]:
s = select([employee])
result = conn.execute(s)
row = result.fetchall()
print(row)

2018-07-31 22:33:41,511 INFO sqlalchemy.engine.base.Engine SELECT employee.id, employee.age, employee.workclass, employee.fnlwgt, employee.education, employee.education_num, employee.marital_status, employee.occupation, employee.relationship, employee.rasexce, employee.sex, employee.capital_gain, employee.capital_loss, employee.hours_per_week, employee.native_country, employee.salary
FROM employee
2018-07-31 22:33:41,529 INFO sqlalchemy.engine.base.Engine ()
[(1, 49, 'State-gov', 77516, 'Bachelors', 13, 'Married', 'Adm-clerical', 'Not-in-family', 'white', 'Male', 2174, 0, 40, 'united-states', '<=50k'), (2, 50, 'Self-emp-not-inc', 83311, 'Bachelors', 13, 'Married-civ-spouse', 'Exec-managerial', 'Husband', 'white', 'Male', 0, 0, 13, 'united-states', '<=50k'), (3, 38, 'Private', 215646, 'HS-grad', 9, 'Divorced', 'Handlers-cleaners', 'Not-in-family', 'white', 'Male', 0, 0, 40, 'united-states', '<=50k')]

In [62]:
# Question No 3
# 3. Write two delete queries

In [63]:
a2=employee.delete().where(employee.c.id==1)
a3=employee.delete().where(employee.c.id==2 and employee.c.sex=='Male')
conn.execute(a2)
conn.execute(a3)

2018-07-31 22:34:51,246 INFO sqlalchemy.engine.base.Engine DELETE FROM employee WHERE employee.id = ?
2018-07-31 22:34:51,265 INFO sqlalchemy.engine.base.Engine (1,)
2018-07-31 22:34:51,272 INFO sqlalchemy.engine.base.Engine COMMIT
2018-07-31 22:34:51,657 INFO sqlalchemy.engine.base.Engine DELETE FROM employee WHERE employee.id = ?
2018-07-31 22:34:51,678 INFO sqlalchemy.engine.base.Engine (2,)
2018-07-31 22:34:51,713 INFO sqlalchemy.engine.base.Engine COMMIT

In [64]:
s = select([employee])
result = conn.execute(s)
row = result.fetchall()
print(row)

2018-07-31 22:35:06,019 INFO sqlalchemy.engine.base.Engine SELECT employee.id, employee.age, employee.workclass, employee.fnlwgt, employee.education, employee.education_num, employee.marital_status, employee.occupation, employee.relationship, employee.rasexce, employee.sex, employee.capital_gain, employee.capital_loss, employee.hours_per_week, employee.native_country, employee.salary
FROM employee
2018-07-31 22:35:06,036 INFO sqlalchemy.engine.base.Engine ()
[(3, 38, 'Private', 215646, 'HS-grad', 9, 'Divorced', 'Handlers-cleaners', 'Not-in-family', 'white', 'Male', 0, 0, 40, 'united-states', '<=50k')]

In [65]:
# Question No 4
# 4. Write two filter queries

In [66]:
from sqlalchemy.orm import sessionmaker
Session = sessionmaker(bind=engine)
session = Session()

In [67]:
a2 = session.query(employee).filter(employee.c.id=='Male').first()
a3 = session.query(employee).filter(employee.c.hours_per_week==45).first()

2018-07-31 22:36:18,838 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2018-07-31 22:36:18,858 INFO sqlalchemy.engine.base.Engine SELECT employee.id AS employee_id, employee.age AS employee_age, employee.workclass AS employee_workclass, employee.fnlwgt AS employee_fnlwgt, employee.education AS employee_education, employee.education_num AS employee_education_num, employee.marital_status AS employee_marital_status, employee.occupation AS employee_occupation, employee.relationship AS employee_relationship, employee.rasexce AS employee_rasexce, employee.sex AS employee_sex, employee.capital_gain AS employee_capital_gain, employee.capital_loss AS employee_capital_loss, employee.hours_per_week AS employee_hours_per_week, employee.native_country AS employee_native_country, employee.salary AS employee_salary
FROM employee
WHERE employee.id = ?
 LIMIT ? OFFSET ?
2018-07-31 22:36:18,864 INFO sqlalchemy.engine.base.Engine ('Male', 1, 0)
2018-07-31 22:36:18,879 INFO sqlalchemy.engine.base.Engine SELECT employee.id AS employee_id, employee.age AS employee_age, employee.workclass AS employee_workclass, employee.fnlwgt AS employee_fnlwgt, employee.education AS employee_education, employee.education_num AS employee_education_num, employee.marital_status AS employee_marital_status, employee.occupation AS employee_occupation, employee.relationship AS employee_relationship, employee.rasexce AS employee_rasexce, employee.sex AS employee_sex, employee.capital_gain AS employee_capital_gain, employee.capital_loss AS employee_capital_loss, employee.hours_per_week AS employee_hours_per_week, employee.native_country AS employee_native_country, employee.salary AS employee_salary
FROM employee
WHERE employee.hours_per_week = ?
 LIMIT ? OFFSET ?
2018-07-31 22:36:18,889 INFO sqlalchemy.engine.base.Engine (45, 1, 0)

In [68]:
# Question No 5
# 5. Write two function queries

In [69]:
from sqlalchemy import func
a2 = session.query(func.count('*')).select_from(employee).scalar()
a3 = session.query(func.count(employee.c.id)).scalar()
print(a2)
print(a3)

2018-07-31 22:37:02,104 INFO sqlalchemy.engine.base.Engine SELECT count(?) AS count_1
FROM employee
2018-07-31 22:37:02,111 INFO sqlalchemy.engine.base.Engine ('*',)
2018-07-31 22:37:02,130 INFO sqlalchemy.engine.base.Engine SELECT count(employee.id) AS count_1
FROM employee
2018-07-31 22:37:02,139 INFO sqlalchemy.engine.base.Engine ()
1
1